const склайт = require('sqlite3').verbose()
const ТГ = require('telebot')
require('dotenv').config()


//Перевірка змінних середовища
console.log('Перевірка змінних середовища')
if(!process.env.TOKEN){
	console.error('Немає змінної TOKEN у файлі .env')
	process.exit(1)
}
if(process.env.INTERVAL) console.warn('Немає змінної INTERVAL у файлі .env, використовую 2000')


//Ініціалізація данних
const бд = new склайт.Database('db.sqlite3', (помилка) => {
	if(помилка){
		console.error('Невдача при підключені до БД')
		process.exit(1)
	}
	console.log('Підключено до БД')
})
const бот = new ТГ({
	token: process.env.TOKEN,
	polling: {
		interval: (process.env.INTERVAL || 2000)
	}
})
process.on('SIGINT', () => {
	бд.close((помилка) => {
		помилка ? console.error(помилка.message) : console.log('Відключенно від БД')
		process.exit(0)
	})
})


//Функції
function випадковеЦілеЧисло(від, до){
	return ~~(Math.random() * (до - від) + від)
}
function відповісти(наЩо, як){
	наЩо.reply.text(як, {replyToMessage: наЩо.message_id})
}
function топ(колбек){
	бд.all('SELECT name, money FROM user ORDER BY money DESC;', колбек)
}
function методБд(запит){
	бд.run(запит, (помилка) => console.error(помилка))
}


//Основні команди
бот.on('/dick', (пов) => {
	користувач = пов.from.id
	бд.get(`SELECT last, money FROM user WHERE id=${користувач};`, (помилка, дані) => {
		if(помилка) console.error(помилка.error)
		else{
			випадковіМонети = випадковеЦілеЧисло(-5, 10)
			зараз = ~~(Date.now() / 1000)
			if(дані){
				залишилосьЧасу = дані.last + 43200 - зараз
				if(залишилосьЧасу > 0){
					відповісти(пов, `
Ви вже грали сьогодні! Зачекайте ще ${~~(залишилосьЧасу/3600)}год та ${~~((залишилосьЧасу%3600)/60)}хв
					`)
				}else{
					новаКілкьістьМонет = дані.money + випадковіМонети
					if(новаКілкьістьМонет < 0) новаКілкьістьМонет = 0
					методБд(`UPDATE user SET money=${новаКілкьістьМонет}, last=${зараз}, name="${пов.from.first_name}" WHERE id=${користувач};`)
					відповісти(пов, `
Вітаємо! Ваша дринда виросла на ${випадковіМонети}см тепер її довжина ${новаКілкьістьМонет}см. Продовжуйте грати через 12 годин!
					`)
				}
			}else{
				if(випадковіМонети < 0) випадковіМонети = 0
				методБд(`INSERT INTO user VALUES(${користувач}, ${випадковіМонети}, ${зараз}, "${пов.from.first_name}");`)
				відповісти(пов, `
Вітаємо у грі найдовша дринда 2.0!
Ваша дринда виросла на ${випадковіМонети}см
Продовжуйте грати через 12 годин
				`)
				console.log(`Зареєстровано ${пов.from.first_name}`)
			}
		}
	})
})

бот.on('/top10', (пов) => {
	топ((помилка, дані) => {
		дані = дані.slice(0, 10)
		відповідь = ''
		номер = 1
		for(ел of дані){
			відповідь += `${номер++}. ${ел.name} - ${ел.money}см\n`
		}
		відповісти(пов, відповідь)
	})
})

бот.on('/me', (пов) => {
	бд.get(`SELECT * FROM user WHERE id=${пов.from.id};`, (помилка, дані) => {
		if(помилка) console.error(помилка.message)
		else{
			if(дані){
				зараз = ~~(Date.now() / 1000)
				залишилосьЧасу = дані.last + 43200 - зараз
				відповідь = `У ${дані.name} дринда ${дані.money}см.\n`
				if(залишилосьЧасу > 0) відповідь += `До нової гри ще ${~~(залишилосьЧасу/3600)}год та ${~~((залишилосьЧасу%3600)/60)}хв`
				else відповідь += 'Нова гра вже доступна'
				відповісти(пов, відповідь)
			}else відповісти(пов, 'Вибачай, але ти не зареєстрований у грі на найдовшу дринду. Пиши /dick і гайда з нами')
		}
	})
})


бот.start()
